## Basic pandas with Series and DataFrame

In [ ]:
# import necessary libraries
import pandas as pd

In [ ]:
# Create a simple list
data = [1,2,3,4,5]

In [ ]:
# print the list
data

[1, 2, 3, 4, 5]

In [ ]:
# Check the type of the data
type(data)

list

In [ ]:
# Convert the list to a pandas Series
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
# Check the type of the Series
type(s)

pandas.core.series.Series

In [ ]:
# Create a DataFrame from the Series
df = pd.DataFrame(s, columns=['num'])
df

   num
0    1
1    2
2    3
3    4
4    5

In [ ]:
# Create a DataFrame from list
df1 = pd.DataFrame(data, columns=['num2'])
df1

   num2
0     1
1     2
2     3
3     4
4     5

In [ ]:
# Convert the Series to a DataFrame
s2 = df1['num2']
s2

0    1
1    2
2    3
3    4
4    5
Name: num2, dtype: int64

In [ ]:
# Check the type of the Series converted to DataFrame
type(s2)

pandas.core.series.Series

In [ ]:
# Create list
data = [[1,2],[3,4],[5,6]]
data

[[1, 2], [3, 4], [5, 6]]

In [ ]:
# Create a DataFrame from the list
df = pd.DataFrame(data, columns=['num1', 'num2'])
df

   num1  num2
0     1     2
1     3     4
2     5     6

In [ ]:
# Select specific columns from the DataFrame
s = df[['num1', 'num2']]
s

   num1  num2
0     1     2
1     3     4
2     5     6

In [ ]:
type(s)

pandas.core.frame.DataFrame

## Dictionary to series and DataFrame

In [ ]:
# import necessary libraries
import pandas as pd

In [ ]:
# create a dictionary with data
data = {
    'name' : ['Alice', 'Bob', 'Charlie'],
    'age' : [25, 30, 35],
    'city' : ['New York', 'Los Angeles', 'Chicago']
}
data

{'name': ['Alice', 'Bob', 'Charlie'],
 'age': [25, 30, 35],
 'city': ['New York', 'Los Angeles', 'Chicago']}

In [ ]:
# create a Series for name from the dictionary
name_series = pd.Series(data['name'], name='name')
name_series

0      Alice
1        Bob
2    Charlie
Name: name, dtype: object

In [ ]:
# create a DataFrame for age
df = pd.DataFrame(data)
df

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
# Create a Series for age
age_series = pd.Series(data['age'], name='age')
age_series

0    25
1    30
2    35
Name: age, dtype: int64

## Set to Series and DataFrame

In [35]:
# import necessary libraries
import pandas as pd

In [ ]:
# Create a set
s1 = {1,2,3,4,3,2,1}
s1

{1, 2, 3, 4}

In [ ]:
# Check the type of the set
type(s1)

set

In [ ]:
# Convert the set to list and convert into a pandas Series
s = pd.Series(list(s1))
s

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
# Create a DataFrame from the set
df = pd.DataFrame(s1, columns=['set_value'] )
df

   set_value
0          1
1          2
2          3
3          4

## Tuple to Series and DataFrame

In [45]:
t = (1,2,4,5,6,7,8, True, False, 'hello', 'world')
s = pd.Series(t)
s

0         1
1         2
2         4
3         5
4         6
5         7
6         8
7      True
8     False
9     hello
10    world
dtype: object

In [46]:
df = pd.DataFrame(t, columns = ['tuple_value'])
df

   tuple_value
0            1
1            2
2            4
3            5
4            6
5            7
6            8
7         True
8        False
9        hello
10       world

In [ ]:
# Check the DataFrame information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   tuple_value  11 non-null     object
dtypes: object(1)
memory usage: 220.0+ bytes

## Numeric Data Type in Pandas

In [1]:
import pandas as pd

In [2]:
# creating DataFrame with integer data
date = {
    'age': [25, 30, 35],
    'salary': [50000, 60000, 70000],
}
df = pd.DataFrame(date)
df

   age  salary
0   25   50000
1   30   60000
2   35   70000